; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-6-220)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-0 - location
	p1-5 - location
	p4-1 - location
	p4-3 - location
	p0-3 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p2-5 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s3)
	(at package2 s1)
	(at package3 s1)
	(at package4 s5)
	(at package5 s3)
	(at package6 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 26)
	(= (time-to-walk p1-0 s1) 26)
	(= (time-to-walk s0 p1-0) 37)
	(= (time-to-walk p1-0 s0) 37)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 29)
	(= (time-to-walk p1-5 s1) 29)
	(= (time-to-walk s5 p1-5) 16)
	(= (time-to-walk p1-5 s5) 16)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 44)
	(= (time-to-walk p4-1 s4) 44)
	(= (time-to-walk s1 p4-1) 30)
	(= (time-to-walk p4-1 s1) 30)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 2)
	(= (time-to-walk p4-3 s4) 2)
	(= (time-to-walk s3 p4-3) 42)
	(= (time-to-walk p4-3 s3) 42)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 31)
	(= (time-to-walk p0-3 s0) 31)
	(= (time-to-walk s3 p0-3) 50)
	(= (time-to-walk p0-3 s3) 50)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 24)
	(= (time-to-walk p2-0 s2) 24)
	(= (time-to-walk s0 p2-0) 1)
	(= (time-to-walk p2-0 s0) 1)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 20)
	(= (time-to-walk p2-1 s2) 20)
	(= (time-to-walk s1 p2-1) 40)
	(= (time-to-walk p2-1 s1) 40)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 30)
	(= (time-to-walk p2-3 s2) 30)
	(= (time-to-walk s3 p2-3) 13)
	(= (time-to-walk p2-3 s3) 13)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 14)
	(= (time-to-walk p2-5 s2) 14)
	(= (time-to-walk s5 p2-5) 18)
	(= (time-to-walk p2-5 s5) 18)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 2)
	(= (time-to-drive s1 s2) 2)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 55)
	(= (time-to-drive s0 s1) 55)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 16)
	(= (time-to-drive s0 s4) 16)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 55)
	(= (time-to-drive s1 s4) 55)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 14)
	(= (time-to-drive s2 s4) 14)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 57)
	(= (time-to-drive s3 s4) 57)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 49)
	(= (time-to-drive s5 s4) 49)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 4)
	(= (time-to-drive s2 s5) 4)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 54)
	(= (time-to-drive s0 s3) 54)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 41)
	(= (time-to-drive s1 s3) 41)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 43)
	(= (time-to-drive s2 s3) 43)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 17)
	(= (time-to-drive s2 s0) 17)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 26)
	(= (time-to-drive s5 s0) 26)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at truck1 s4)
	(at package1 s5)
	(at package2 s1)
	(at package3 s4)
	(at package4 s2)
	(at package5 s2)
	(at package6 s5)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 2 of 9
2. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 3 of 9
3. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   goals met: 2 of 9
4. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   goals met: 2 of 9
5. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 9
6. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 0 to 160
   goals met: 3 of 9
7. (load-truck package6 truck1 s4)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 9
8. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 160 to 765
   goals met: 2 of 9
9. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 9
10. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 765 to 1480
   goals met: 3 of 9
11. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 9
12. (drive-truck truck1 s4 s3 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 1480 to 2107
   goals met: 3 of 9
13. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 9
14. (drive-truck truck1 s3 s2 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 2107 to 2666
   goals met: 3 of 9
15. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 9
16. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 2666 to 2710
   goals met: 4 of 9
17. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 9
18. (drive-truck truck1 s5 s2 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (fuel-used) from 2710 to 2762
   goals met: 4 of 9
19. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 2762 to 3321
   goals met: 4 of 9
20. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 4 of 9
21. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 3321 to 4233
   goals met: 5 of 9
22. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 4233 to 5017
   goals met: 4 of 9
23. (unload-truck package1 truck1 s5)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 9
24. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (fuel-used) from 5017 to 5654
   goals met: 6 of 9
25. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 5654 to 6369
   goals met: 5 of 9
26. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 6 of 9
27. (unload-truck package6 truck1 s1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 9
28. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 9
29. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 6369 to 6389
   goals met: 5 of 9
30. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 9
31. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 6389 to 6994
   goals met: 5 of 9
32. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 6994 to 7533
   goals met: 4 of 9
33. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 9
34. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 7533 to 7555
   goals met: 4 of 9
35. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 5 of 9
36. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 5 of 9
37. (walk driver2 s5 p1-5)
   deleted: (at driver2 s5)
   added: (at driver2 p1-5)
   goals met: 5 of 9
38. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 9
39. (unload-truck package4 truck1 s5)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 4 of 9
40. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 7555 to 7599
   goals met: 4 of 9
41. (load-truck package4 truck2 s5)
   deleted: (at package4 s5)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 4 of 9
42. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 4 of 9
43. (walk driver1 s5 p2-5)
   deleted: (at driver1 s5)
   added: (at driver1 p2-5)
   goals met: 4 of 9
44. (walk driver2 p1-5 s5)
   deleted: (at driver2 p1-5)
   added: (at driver2 s5)
   goals met: 4 of 9
45. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 9
46. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (fuel-used) from 7599 to 7651
   goals met: 4 of 9
47. (walk driver1 p2-5 s5)
   deleted: (at driver1 p2-5)
   added: (at driver1 s5)
   goals met: 4 of 9
48. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 9
49. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 7651 to 7677
   goals met: 4 of 9
50. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 5 of 9
51. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 5 of 9
52. (drive-truck truck1 s5 s2 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (fuel-used) from 7677 to 7717
   goals met: 5 of 9
53. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 9
54. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 6 of 9
55. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 9
56. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 9
57. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 7717 to 7739
   goals met: 5 of 9
58. (drive-truck truck2 s2 s5 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 7739 to 7783
   goals met: 5 of 9
59. (unload-truck package6 truck2 s5)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 9
60. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 9
61. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 7783 to 7923
   goals met: 6 of 9
62. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 6 of 9
63. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (fuel-used) from 7923 to 7963
   goals met: 6 of 9
64. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 7963 to 7983
   goals met: 6 of 9
65. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 9
66. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 7983 to 8005
   goals met: 6 of 9
67. (drive-truck truck2 s2 s4 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 8005 to 8159
   goals met: 6 of 9
68. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 6 of 9
69. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 6 of 9
70. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 9
71. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 7 of 9
72. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 8159 to 8313
   goals met: 7 of 9
73. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 8 of 9
74. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 9
